Importacion de librerias

In [55]:
import pandas as pd
import numpy as np

Carga de los datasets

In [56]:
#importación de ficheros Excel 
df_orders = pd.read_excel('../Datos/orders.xlsx', engine='openpyxl')
df_food = pd.read_excel('../Datos/food.xlsx', engine='openpyxl')
df_menu = pd.read_excel('../Datos/menu.xlsx', engine='openpyxl')
df_restaurant = pd.read_excel('../Datos/restaurant.xlsx', engine='openpyxl')
df_users = pd.read_excel('../Datos/users.xlsx', engine='openpyxl')

Exploracion inicial de los diferentes datasets

In [57]:
# Exploración inicial de los datos df_food
df_food.info()
df_food.sample(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 371560 entries, 0 to 371559
Data columns (total 3 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   f_id            371552 non-null  object
 1   item            371552 non-null  object
 2   veg_or_non_veg  371552 non-null  object
dtypes: object(3)
memory usage: 8.5+ MB

,f_id,item,veg_or_non_veg
60950,fd124986,Choco Strawberry Shake,Veg
233255,fd622570,Cafetone Special Chicken Sub,Non-veg
37540,fd76222,Medium Country Special,Veg
284794,fd789118,Jamun & Black Salt Smoothie - No Added Sugar [...,Veg
223472,fd591039,Tandoori Cream Chicken,Non-veg

In [70]:
#comprobamos si hay valores nulos
print(df_food.isnull().sum())
#comprobamos si hay valores repetidos
print(df_food.duplicated().sum())
#comprobamos cuantas valores unicos hay en cada columna
print(df_food.nunique())

f_id              8
item              8
veg_or_non_veg    8
dtype: int64
7
f_id              371552
item              369347
veg_or_non_veg         2
dtype: int64

In [59]:
# Exploración inicial de los datos df_menu
df_menu.info()
df_menu.sample(15)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 5 columns):
 #   Column   Non-Null Count    Dtype
---  ------   --------------    -----
 0   menu_id  1048575 non-null  object
 1   r_id     1048575 non-null  int64
 2   f_id     1048575 non-null  object
 3   cuisine  1048575 non-null  object
 4   price    1048574 non-null  float64
dtypes: float64(1), int64(1), object(3)
memory usage: 40.0+ MB

          menu_id    r_id      f_id                    cuisine  price
745793   mn176542   44373  fd176542                   Desserts  190.0
60221    mn911729  186263     fd381       American,Continental  230.0
1008510  mn698464  574815  fd679209        North Indian,Indian  130.0
159092   mn529579  158827  fd807898     Fast Food,North Indian  300.0
510230    mn42872  258777   fd42872       Chinese,North Indian  280.0
106293   mn615546  103560     fd822        North Indian,Snacks  210.0
761921   mn195750  326391  fd195750       North Indian,Punjabi  260.0
55306    mn364978  521968     fd319           Pizzas,Fast Food  150.0
148409   mn888571     305    fd1227  South Indian,North Indian   85.0
567833   mn597219   80711   fd71856       North Indian,Punjabi  385.0
366528   mn821301  233154    fd8163             Chinese,Indian  220.0
594750   mn973845  186085   fd81941         Biryani,Hyderabadi  319.0
801549   mn257344  511562  fd257344              Snacks,Indian  350.0
772146   mn274073  483532  fd210193        Indian,South Indian  150.0
929449   mn509862  280455  fd508859                     Bakery  700.0

In [71]:
#comprobamos si hay valores nulos
print(df_menu.isnull().sum())
#comprobamos si hay valores repetidos
print(df_menu.duplicated().sum())
#comprobamos cuantas valores unicos hay en cada columna
print(df_menu.nunique())

menu_id    0
r_id       0
f_id       0
cuisine    0
price      1
dtype: int64
0
menu_id    918168
r_id        12117
f_id       282381
cuisine      1436
price        3308
dtype: int64

In [ ]:
#comprobamos la cantidad de restaurantes que tienen el mismo menu_id
print(df_menu['menu_id'].value_counts())

menu_id
mn949133    2
mn778917    2
mn916630    2
mn778910    2
mn69201     2
           ..
mn839251    1
mn780169    1
mn780167    1
mn780166    1
mn780151    1
Name: count, Length: 918168, dtype: int64

In [72]:
#comprobamos la fila que tiene un valor nulo en price
print(df_menu[df_menu['price'].isnull()])

         menu_id    r_id      f_id       cuisine  price
878051  mn414862  496987  fd413746  South Indian    NaN

In [60]:
# Exploración inicial de los datos df_orders
df_orders.info()
df_orders.sample(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150281 entries, 0 to 150280
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   order_date    150281 non-null  datetime64[ns]
 1   sales_qty     150281 non-null  int64
 2   sales_amount  150281 non-null  int64
 3   currency      150281 non-null  object
 4   user_id       150281 non-null  int64
 5   r_id          148664 non-null  float64
dtypes: datetime64[ns](1), float64(1), int64(3), object(1)
memory usage: 6.9+ MB

       order_date  sales_qty  sales_amount currency  user_id      r_id
90313  2018-04-11          1           269      INR    86166  484514.0
94561  2019-03-21          2           856      INR     4651  147188.0
72718  2017-12-19          9          2852      INR    16119  407019.0
128314 2018-08-20          1           394      INR    67530  554179.0
147104 2020-02-21          1             0      INR    22506  375567.0

In [73]:
#comprobamos los valores nulos
print(df_orders.isnull().sum())
#comprobamos los valores duplicados
print(df_orders.duplicated().sum())
#comprobamos los valores unicos en cada columna
print(df_orders.nunique())

order_date         0
sales_qty          0
sales_amount       0
currency           0
user_id            0
r_id            1617
dtype: int64
0
order_date         806
sales_qty          566
sales_amount      7983
currency             1
user_id          77929
r_id            148541
dtype: int64

In [62]:
# Exploración inicial de los datos df_restaurant
df_restaurant.info()
df_restaurant.sample(15)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148540 entries, 0 to 148539
Data columns (total 9 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   id            148540 non-null  int64
 1   name          148454 non-null  object
 2   Country       148540 non-null  object
 3   city          148540 non-null  object
 4   rating        148454 non-null  object
 5   rating_count  148454 non-null  object
 6   cuisine       148441 non-null  object
 7   link          148540 non-null  object
 8   address       148454 non-null  object
dtypes: int64(1), object(8)
memory usage: 10.2+ MB

,id,name,Country,city,rating,rating_count,cuisine,link,address
30447,286431,Sea View,India,Central-goa,--,Too Few Ratings,Chinese,https://www.swiggy.com/restaurants/sea-view-ba...,"Sea View, NEXT TO POLICE OUTPOST, OPPOSITE N.I..."
146506,485142,Cool Blu,India,"Governorpet,Vijayawada",--,Too Few Ratings,Indian,https://www.swiggy.com/restaurants/cool-blu-go...,"Cool Blu, 25-1-1,BHAGATH SINGH NAGAR,VIJAYAWADA"
53286,482817,Sweet Teeth,India,"Uttam Nagar,Delhi",--,Too Few Ratings,"North Indian,Chinese",https://www.swiggy.com/restaurants/sweet-teeth...,"Sweet Teeth, B-9, SHOP NO-2, RAMA PARK, UTTAM ..."
71994,317394,New grand Restaurant & bakery,India,"Himayath Nagar,Hyderabad",3.7,100+ ratings,"Chinese,Mughlai",https://www.swiggy.com/restaurants/new-grand-r...,"New grand Restaurant & bakery, 15-9-444, afzal..."
92913,505603,Kebabs In Roll,India,"Bally,Kolkata",3.8,50+ ratings,"Biryani,Kebabs",https://www.swiggy.com/restaurants/kebabs-in-r...,"Kebabs In Roll, G-10, 11G-10, 11 NABAPROVAT KE..."
80670,494222,Hyderabadi Healthy Food House,India,"Tolichowki,Hyderabad",--,Too Few Ratings,Snacks,https://www.swiggy.com/restaurants/hyderabadi-...,"Hyderabadi Healthy Food House, Hno 8-1-363/14,..."
115080,428439,Chai Kalari,India,Narsinghpur,--,Too Few Ratings,"Beverages,Fast Food",https://www.swiggy.com/restaurants/chai-kalari...,"Chai Kalari, Shop No. 02 Dada Maharaj Narsingh..."
75819,501920,Om Sri Sai Ram Tiffin Centre & Fast-Food Centre &,India,"Vanasthalipuram,Hyderabad",--,Too Few Ratings,South Indian,https://www.swiggy.com/restaurants/om-sri-sai-...,Om Sri Sai Ram Tiffin Centre & Fast-Food Centr...
144056,562998,Natural Ice Cream,India,"Akota,Vadodara",4.8,50+ ratings,Ice Cream,https://www.swiggy.com/restaurants/natural-ice...,"Natural Ice Cream, Shop No-6, The emerald, Har..."
67394,168082,Cool Deck Coffee,India,"Old Gurgaon (Zone 6),Gurgaon",--,Too Few Ratings,"Beverages,Fast Food",https://www.swiggy.com/restaurants/cool-deck-c...,"Cool Deck Coffee, shop no -08 Gf, zara Arcadia..."
91850,266332,VEG NASTA,India,"Salt Lake,Kolkata",--,Too Few Ratings,"Indian,Desserts",https://www.swiggy.com/restaurants/veg-nasta-s...,"VEG NASTA, MB 72 AQ Block Salt lake sector 5 K..."
73171,574152,Shawarma Buzz,India,"Kothapet & Dilsukhnagar,Hyderabad",--,Too Few Ratings,Arabian,https://www.swiggy.com/restaurants/shawarma-bu...,"Shawarma Buzz, NO.16-2-754/1/1, ASMANGADH, GAD..."
94793,235891,Night Angels Kitchen,India,"Behala,Kolkata",--,Too Few Ratings,"Bengali,Chinese",https://www.swiggy.com/restaurants/night-angel...,"Night Angels Kitchen, 22/10D MAHENDRA BANERJEE..."
96778,547215,BENGALI HOME STYLE IN BIJOYGARH,India,"Jadavpur,Kolkata",--,Too Few Ratings,"Bengali,Indian",https://www.swiggy.com/restaurants/bengali-hom...,"BENGALI HOME STYLE IN BIJOYGARH, 2/29A BEJOYGA..."
71106,476053,Hungry Place,India,Hoshiarpur,--,Too Few Ratings,"Pizzas,American",https://www.swiggy.com/restaurants/hungry-plac...,"Hungry Place, Bhim Nagar Hoshiarpur"

In [74]:
#comprobamos los valores nulos
print(df_restaurant.isnull().sum())
#comprobamos los valores duplicados
print(df_restaurant.duplicated().sum())
#comprobamos los valores unicos en cada columna
print(df_restaurant.nunique())

id               0
name            86
Country          0
city             0
rating          86
rating_count    86
cuisine         99
link             0
address         86
dtype: int64
0
id              148540
name            112817
Country              1
city               821
rating              42
rating_count         8
cuisine           2132
link            148540
address         148400
dtype: int64

In [65]:
# Exploración inicial de los datos df_users
df_users.info()
df_users.sample(30)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 6 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         100000 non-null  int64
 1   name            100000 non-null  object
 2   Age             100000 non-null  int64
 3   Gender          100000 non-null  object
 4   Marital Status  100000 non-null  object
 5   Occupation      100000 non-null  object
dtypes: int64(2), object(4)
memory usage: 4.6+ MB

,user_id,name,Age,Gender,Marital Status,Occupation
65401,65402,Darlene Turner,26,Male,Single,Employee
12466,12467,Patricia Ibarra,23,Female,Single,Student
48124,48125,Christopher Hudson,23,Male,Single,Student
42832,42833,Daniel Sloan,20,Male,Single,Student
94785,94786,Mrs. Brandi Brown,23,Female,Single,Student
860,861,Michael Schneider,23,Male,Single,Student
17923,17924,Edwin Wilcox,24,Female,Single,Student
95721,95722,Michelle Hammond,24,Female,Married,Employee
53108,53109,Carrie Collins,23,Male,Single,Student
8292,8293,James Hill,24,Male,Single,Student
3685,3686,James Martinez DDS,26,Male,Single,Employee
71301,71302,Timothy Wiley,22,Male,Single,Employee
87067,87068,Stacey Booth,23,Female,Single,Student
86697,86698,Mr. Gary Stokes DVM,25,Female,Single,Student
68336,68337,Troy Bullock,23,Female,Single,Student
85860,85861,Abigail Todd,25,Male,Single,Student
63609,63610,Phillip Valdez,22,Male,Single,Student
12143,12144,Mike Wade,25,Female,Married,Employee
90022,90023,Andrew Love,22,Male,Single,Student
39493,39494,Kathy Moreno,24,Female,Single,Student
86162,86163,Justin Roberts,22,Female,Single,Student
38340,38341,Caroline Norman,32,Male,Married,Employee
36290,36291,Julia Gibson,29,Male,Married,Employee
96478,96479,Kelly Moon,30,Female,Married,House wife
22863,22864,Justin Sandoval,29,Male,Single,Self Employeed
81718,81719,Shelly Summers,27,Male,Married,Employee
86620,86621,Andrea Woods,23,Female,Single,Student
70132,70133,Crystal Mendez,24,Female,Single,Student
79621,79622,Matthew Williams,23,Female,Single,Student
21103,21104,Eric Dunlap,23,Female,Single,Student

In [75]:
#comprobamos los valores nulos
print(df_users.isnull().sum())
#comprobamos los valores duplicados
print(df_users.duplicated().sum())
#comprobamos los valores unicos en cada columna
print(df_users.nunique())

user_id           0
name              0
Age               0
Gender            0
Marital Status    0
Occupation        0
dtype: int64
0
user_id           100000
name               71251
Age                   16
Gender                 2
Marital Status         3
Occupation             4
dtype: int64

Limpieza por dataset

In [ ]:
#juntamos los dataframes df_menu y df_food by f_id
df_menu_food = pd.merge(df_menu, df_food, on='f_id', how='left')
df_menu_food.head(5)

In [ ]:
#cambiamos el nombre de la columna id de df_restaurant a r_id para hacer el merge
df_restaurant = df_restaurant.rename(columns={'id': 'r_id'})

#juntamos los dataframes df_restaurant y df_menu_food by r_id
df_restaurant_menu_food = pd.merge(df_restaurant, df_menu_food, on='r_id', how='left')
df_restaurant_menu_food.head(5)

In [ ]:
#juntamos los dataframes orders y df_users by u_id
df_orders_users = pd.merge(df_orders, df_users, on='user_id', how='left')
df_orders_users.head(5)

In [ ]:
#comprobamos la info entre los dataframes df_orders_users y df_restaurant_menu_food
df_orders_users.info()
df_restaurant_menu_food.info()

In [ ]:
#hacemos el merge final entre df_orders_users y df_restaurant_menu_food by r_id
df_full = pd.merge(df_orders_users, df_restaurant_menu_food, on='r_id', how='left')
df_full.head(5)

In [ ]:
#miramos la info del dataframe final
df_full.info()

In [ ]:
#comprobamos si hay valores repetidos
df_full.duplicated().sum()